rprouse/ESP32_CYD_Weather_Station_With_Forecast/src/main.cpp
  tft.setTextPadding(0);
  tft.unloadFont();
}

/***************************************************************************************
**                          Draw the clock digits
***************************************************************************************/
void drawTime() {
  tft.loadFont(AA_FONT_LARGE, LittleFS);

  // Convert UTC to local time, returns zone code in tz1_Code, e.g "GMT"
  time_t local_time = TIMEZONE.toLocal(now(), &tz1_Code);

  String timeNow = "";

  if (hour(local_time) < 10) timeNow += "0";
  timeNow += hour(local_time);
  timeNow += ":";
  if (minute(local_time) < 10) timeNow += "0";
  timeNow += minute(local_time);

  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.setTextPadding(tft.textWidth("44:44"));  // String width
  tft.drawString(timeNow, CLOCK_X, CLOCK_Y);

  drawSeparator(HEADER_DIV_Y);

  tft.setTextPadding(0);

  tft.unloadFont();
}

/***************************************************************************************
**                          Draw the current weather
***************************************************************************************/
void drawCurrentWeather() {
  time_t local_time = TIMEZONE.toLocal(now(), &tz1_Code);
  //String date = "Updated: " + strDate(local_time);
  String date = "Updated: " + strDate(now());  // see isue https://github.com/Bodmer/OpenWeather/issues/26
  String weatherText = "None";

  // Location label (top-right)
  tft.setTextDatum(TR_DATUM);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.setTextPadding(tft.textWidth(" Wwwwwwwwwwwwww "));  // wide enough to erase old label
  tft.drawString(location, LOCATION_X, LOCATION_Y);

  // Updated timestamp (top-right, below the location)
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.setTextPadding(tft.textWidth(" Updated: Mmm 44 44:44 "));  // String width + margin
  tft.drawString(date, UPDATED_X, UPDATED_Y);

  String weatherIcon = "";

  String currentSummary = forecast->main[0];
  currentSummary.toLowerCase();

  weatherIcon = getMeteoconIcon(forecast->id[0], true);

  ui.drawBmp("/icon/" + weatherIcon + ".bmp", CUR_ICON_X, CUR_ICON_Y);

  // Weather Text
  if (language == "en")
    weatherText = forecast->main[0];
  else
    weatherText = forecast->description[0];

  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);

  int splitPoint = splitIndex(weatherText);

  tft.setTextPadding(tft.textWidth(" Wwwwwwww "));  // erase old label width
  if (splitPoint) {
    tft.drawString(weatherText.substring(0, splitPoint), COND_LABEL_X, COND_LABEL_Y);
    tft.drawString(weatherText.substring(splitPoint),    COND_LABEL_X, COND_LABEL_Y + 16);
  } else {
    tft.drawString(weatherText, COND_LABEL_X, COND_LABEL_Y);
    tft.drawString(" ",         COND_LABEL_X, COND_LABEL_Y + 16);
  }

  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextPadding(0);
  if (units == "metric") tft.drawString("oC", TEMP_UNIT_X, TEMP_UNIT_Y);
  else tft.drawString("oF", TEMP_UNIT_X, TEMP_UNIT_Y);

  //Temperature large digits added in updateData() to save swapping font here

  tft.setTextColor(TFT_ORANGE, TFT_BLACK);
  weatherText = String(forecast->wind_speed[0], 0);

  if (units == "metric") weatherText += " m/s";
  else weatherText += " mph";

  tft.setTextDatum(TL_DATUM);
  tft.setTextPadding(tft.textWidth("888 m/s"));  // Max string length?
  tft.drawString(weatherText, WIND_TXT_X, WIND_SPEED_Y);

  if (units == "imperial") {
    weatherText = forecast->pressure[0];
    weatherText += " in";
  } else {
    weatherText = String(forecast->pressure[0], 0);
    weatherText += " hPa";
  }

  tft.setTextDatum(TL_DATUM);
  tft.setTextPadding(tft.textWidth("8888 hPa"));  // Max string length?
  tft.drawString(weatherText, WIND_TXT_X, WIND_PRESS_Y);

  int windAngle = (forecast->wind_deg[0] + 22.5) / 45;
  if (windAngle > 7) windAngle = 0;
  String wind[] = { "N", "NE", "E", "SE", "S", "SW", "W", "NW" };
  ui.drawBmp("/wind/" + wind[windAngle] + ".bmp", WIND_ICON_X, WIND_ICON_Y);

  tft.drawFastVLine(COL_DIV_X, COL_DIV_TOP, COL_DIV_BOT - COL_DIV_TOP, 0x4228);

  tft.setTextDatum(TL_DATUM);  // Reset datum to normal
  tft.setTextPadding(0);       // Reset padding width to none
}

/***************************************************************************************
**                          Draw the 4 forecast columns
***************************************************************************************/
// draws the 2x2 grid of 4 forecast days
void drawForecast() {
  int8_t dayIndex = getNextDayIndex();

  drawForecastDetail(FC_COL_L_X, FC_R1_DAY_Y, FC_R1_TEMP_Y, FC_R1_ICON_Y, dayIndex);  // TUE
  dayIndex += 8;
  drawForecastDetail(FC_COL_R_X, FC_R1_DAY_Y, FC_R1_TEMP_Y, FC_R1_ICON_Y, dayIndex);  // WED
  dayIndex += 8;
  drawForecastDetail(FC_COL_L_X, FC_R2_DAY_Y, FC_R2_TEMP_Y, FC_R2_ICON_Y, dayIndex);  // THU
  dayIndex += 8;
  drawForecastDetail(FC_COL_R_X, FC_R2_DAY_Y, FC_R2_TEMP_Y, FC_R2_ICON_Y, dayIndex);  // FRI

  drawSeparator(BOTTOM_DIV_Y);
}

/***************************************************************************************
**                          Draw 1 forecast column at x, y
***************************************************************************************/
// helper for the forecast columns
void drawForecastDetail(uint16_t cx, uint16_t dayY, uint16_t tempY, uint16_t iconY, uint8_t dayIndex) {

  if (dayIndex >= MAX_DAYS * 8) return;

  String day = shortDOW[weekday(TIMEZONE.toLocal(forecast->dt[dayIndex + 4], &tz1_Code))];
  day.toUpperCase();

  // Day label (gold, centred on the column)
  tft.setTextDatum(TC_DATUM);
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);
  tft.setTextPadding(tft.textWidth("WWW"));
  tft.drawString(day, cx, dayY);

  // Find the temperature min and max during the day
  float tmax = -9999;
  float tmin = 9999;
  for (int i = 0; i < 8; i++)
    if (forecast->temp_max[dayIndex + i] > tmax) tmax = forecast->temp_max[dayIndex + i];
  for (int i = 0; i < 8; i++)
    if (forecast->temp_min[dayIndex + i] < tmin) tmin = forecast->temp_min[dayIndex + i];

  String highTemp = String(tmax, 0);
  String lowTemp = String(tmin, 0);

  // High (white) ends just left of centre; low (cyan) starts just right of centre
  tft.setTextPadding(tft.textWidth("-88"));
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setTextDatum(TR_DATUM);
  tft.drawString(highTemp, cx - 3, tempY);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.drawString(lowTemp, cx + 3, tempY);

  // Condition icon (32x32) centred on the column
  String weatherIcon = getMeteoconIcon(forecast->id[dayIndex + 4], false);
  ui.drawBmp("/icon50/" + weatherIcon + ".bmp", cx - 16, iconY);

