rprouse/ESP32_CYD_Weather_Station_With_Forecast/src/main.cpp
  tft.setTextPadding(0);  // Reset padding width to none
}

/***************************************************************************************
**                          Draw Sun rise/set, Moon, cloud cover and humidity
***************************************************************************************/
void drawAstronomy() {

  tft.setTextDatum(BC_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setTextPadding(tft.textWidth(" Last qtr "));

  time_t local_time = TIMEZONE.toLocal(forecast->dt[0], &tz1_Code);
  uint16_t y = year(local_time);
  uint8_t m = month(local_time);
  uint8_t d = day(local_time);
  uint8_t h = hour(local_time);
  int ip;
  uint8_t icon = moon_phase(y, m, d, h, &ip);

  ui.drawBmp("/moon/moonphase_L" + String(icon) + ".bmp", MOON_CX - 17, MOON_ICON_Y);
  tft.drawString(moonPhase[ip], MOON_CX, MOON_LABEL_Y);

  // Sun header (centred)
  tft.setTextDatum(TC_DATUM);
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);
  tft.setTextPadding(0);  // Reset padding width to none
  tft.drawString(sunStr, SUN_X, SUN_HDR_Y);

  // Sunrise / sunset times, each preceded by a line-drawn arrow, centred as a unit.
  // ML_DATUM => y is the vertical centre of the text, matching the arrow centre.
  tft.setTextDatum(ML_DATUM);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.setTextPadding(tft.textWidth("88:88"));

  String rising = strTime(forecast->sunrise);
  int textX = SUN_X - (8 + tft.textWidth(rising)) / 2 + 8;  // centre the arrow+time pair
  drawArrow(textX - 6, SUN_RISE_Y, true, TFT_CYAN);
  tft.drawString(rising, textX, SUN_RISE_Y);

  String setting = strTime(forecast->sunset);
  textX = SUN_X - (8 + tft.textWidth(setting)) / 2 + 8;
  drawArrow(textX - 6, SUN_SET_Y, false, TFT_CYAN);
  tft.drawString(setting, textX, SUN_SET_Y);

  // Cloud (centred column)
  tft.setTextDatum(TC_DATUM);
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);
  tft.setTextPadding(0);
  tft.drawString(cloudStr, CLOUD_X, BB_LABEL_Y);

  String cloudCover = "";
  cloudCover += forecast->clouds_all[0];
  cloudCover += "%";

  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setTextPadding(tft.textWidth(" 100% "));
  tft.drawString(cloudCover, CLOUD_X, BB_VALUE_Y);

  // Humidity (centred column)
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);
  tft.setTextPadding(0);
  tft.drawString(humidityStr, HUM_X, BB_LABEL_Y);

  String humidity = "";
  humidity += forecast->humidity[0];
  humidity += "%";

  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.setTextPadding(tft.textWidth(" 100% "));
  tft.drawString(humidity, HUM_X, BB_VALUE_Y);

  tft.setTextPadding(0);  // Reset padding width to none
}

/***************************************************************************************
**                          Get the icon file name from the index number
***************************************************************************************/
const char* getMeteoconIcon(uint16_t id, bool today) {
  // if ( today && id/100 == 8 && (forecast->dt[0] < forecast->sunrise || forecast->dt[0] > forecast->sunset)) id += 1000;
  if (today && id / 100 == 8 && (now() < forecast->sunrise || now() > forecast->sunset)) id += 1000;
  // see issue https://github.com/Bodmer/OpenWeather/issues/26
  if (id / 100 == 2) return "thunderstorm";
  if (id / 100 == 3) return "drizzle";
  if (id / 100 == 4) return "unknown";
  if (id == 500) return "lightRain";
  else if (id == 511) return "sleet";
  else if (id / 100 == 5) return "rain";
  if (id >= 611 && id <= 616) return "sleet";
  else if (id / 100 == 6) return "snow";
  if (id / 100 == 7) return "fog";
  if (id == 800) return "clear-day";
  if (id == 801) return "partly-cloudy-day";
  if (id == 802) return "cloudy";
  if (id == 803) return "cloudy";
  if (id == 804) return "cloudy";
  if (id == 1800) return "clear-night";
  if (id == 1801) return "partly-cloudy-night";
  if (id == 1802) return "cloudy";
  if (id == 1803) return "cloudy";
  if (id == 1804) return "cloudy";

  return "unknown";
}

/***************************************************************************************
**                          Draw screen section separator line
***************************************************************************************/
// if you don't want separators, comment out the tft-line
void drawSeparator(uint16_t y) {
  tft.drawFastHLine(10, y, SCREEN_W - 2 * 10, 0x4228);
}

/***************************************************************************************
**                          Draw a small up/down arrow from line primitives
***************************************************************************************/
// ~8px tall, vertically centred on yCentre, horizontally centred on x.
void drawArrow(int x, int yCentre, bool up, uint16_t colour) {
  int half = 4;  // half-height -> ~8px tall
  int top = yCentre - half;
  int bot = yCentre + half;
  tft.drawLine(x, top, x, bot, colour);  // vertical shaft
  if (up) {
    tft.drawLine(x, top, x - 3, top + 4, colour);  // left head
    tft.drawLine(x, top, x + 3, top + 4, colour);  // right head
  } else {
    tft.drawLine(x, bot, x - 3, bot - 4, colour);  // left head
    tft.drawLine(x, bot, x + 3, bot - 4, colour);  // right head
  }
}

/***************************************************************************************
**                          Determine place to split a line line
***************************************************************************************/
// determine the "space" split point in a long string
int splitIndex(String text) {
  uint16_t index = 0;
  while ((text.indexOf(' ', index) >= 0) && (index <= text.length() / 2)) {
    index = text.indexOf(' ', index) + 1;
  }
  if (index) index--;
  return index;
}

/***************************************************************************************
**                          Right side offset to a character
***************************************************************************************/
// Calculate coord delta from end of text String to start of sub String contained within that text
// Can be used to vertically right align text so for example a colon ":" in the time value is always
// plotted at same point on the screen irrespective of different proportional character widths,
// could also be used to align decimal points for neat formatting
int rightOffset(String text, String sub) {
  int index = text.indexOf(sub);
  return tft.textWidth(text.substring(index));
}

/***************************************************************************************
**                          Left side offset to a character
***************************************************************************************/
// Calculate coord delta from start of text String to start of sub String contained within that text
// Can be used to vertically left align text so for example a colon ":" in the time value is always
// plotted at same point on the screen irrespective of different proportional character widths,
// could also be used to align decimal points for neat formatting
int leftOffset(String text, String sub) {
  int index = text.indexOf(sub);
  return tft.textWidth(text.substring(0, index));
}

/***************************************************************************************
**                          Draw circle segment
***************************************************************************************/
// Draw a segment of a circle, centred on x,y with defined start_angle and subtended sub_angle
// Angles are defined in a clockwise direction with 0 at top
// Segment has radius r and it is plotted in defined colour
// Can be used for pie charts etc, in this sketch it is used for wind direction
#define DEG2RAD 0.0174532925  // Degrees to Radians conversion factor
#define INC 2                 // Minimum segment subtended angle and plotting angle increment (in degrees)
void fillSegment(int x, int y, int start_angle, int sub_angle, int r, unsigned int colour) {
  // Calculate first pair of coordinates for segment start
  float sx = cos((start_angle - 90) * DEG2RAD);
  float sy = sin((start_angle - 90) * DEG2RAD);
  uint16_t x1 = sx * r + x;
  uint16_t y1 = sy * r + y;

  // Draw colour blocks every INC degrees
  for (int i = start_angle; i < start_angle + sub_angle; i += INC) {

